---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.VisGraphicsAnalyticalModel
source: html/4fee30ed-8813-09fc-fac9-fcb64fb59bef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.VisGraphicsAnalyticalModel Property

"V/G Overrides Analytical Model"

## Syntax (C#)
```csharp
public static ForgeTypeId VisGraphicsAnalyticalModel { get; }
```